# Taps
tap "derailed/k9s"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "homebrew/services"
tap "hashicorp/tap"
tap "ngrok/ngrok"

# Binaries
brew "stow"
brew "coreutils"
brew "pkg-config"
brew "bash"
brew "git"
brew "git-lfs"
brew "svn"
brew "gnupg"
brew "grep"
brew "jq"
brew "tmux"
brew "fd"
brew "ripgrep"
brew "watch"
brew "pure"
brew "neovim"
brew "asdf"
brew "awscli"
brew "aws-iam-authenticator"
brew "derailed/k9s/k9s"
brew "helm"
brew "hashicorp/tap/terraform"
brew "terragrunt"
brew "argocd"
brew "protobuf"
brew "shellcheck"
brew "stylua"
brew "redis"
brew "postgresql"

# Language + Tooling
cask "dotnet-sdk"

# Apps
cask '1password'
brew '1password-cli'
cask "karabiner-elements"
cask 'docker'
cask 'google-chrome'
cask 'slack'
cask 'zoom'
cask "ngrok"

# Fonts
cask "font-fira-code-nerd-font"
