# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Core
brew 'pkg-config'
brew 'ripgrep'
brew 'bash'
brew 'coreutils'
brew 'ffmpeg'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'jq'
brew 'neovim'
brew 'tmux'
brew 'svn'
brew 'kubectl'
brew 'helm'
brew 'awscli'

# Development
brew 'java'
brew 'golang'
brew 'php'
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'postgresql'
brew 'lua-language-server'
brew 'jdtls'

# Fonts
cask 'font-fira-code-nerd-font'
