# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'hashicorp/tap'

# Core
brew 'pkg-config'
brew 'ripgrep'
brew 'bash'
brew 'coreutils'
brew 'git'
brew 'git-lfs'
brew 'gnupg'
brew 'grep'
brew 'jq'
brew 'neovim'
brew 'tmux'
brew 'svn'
brew 'kubectl'
brew 'helm'
brew 'awscli'
brew 'hashicorp/tap/terraform'
brew 'protobuf'
brew 'shellcheck'
brew 'fd'
brew 'glow'
brew 'pure'
cask 'karabiner-elements'

# Development
brew 'java'
brew 'golang'
brew 'python'
brew 'php'
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'postgresql'
brew 'stylua'
brew 'google-java-format'

# Fonts
cask 'font-fira-code-nerd-font'
